fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда)
		
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ПоказатьПредупреждение(, "Не указан период!");
		Возврат;
	КонецЕсли; 
	
	ДлительнаяОперация = НачатьСозданиеАктовНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеСозданияАктов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания); 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеСозданияАктов(Результат, ДополнительныеПараметры) Экспорт   
	
	Если Результат.Статус = "Ошибка" Тогда
		ШаблонТекста = "Ошибка при создании актов: ";
		ТекстОшибки = ШаблонТекста + Результат.КраткоеПредставлениеОшибки;
		ПоказатьПредупреждение(, ТекстОшибки);
	ИначеЕсли Результат.Статус = "Выполнено" Тогда 
		ЗаполнитьТЧ(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
		ПоказатьПредупреждение(, "Создание актов завершено.");
	Иначе
		ПоказатьПредупреждение(, "Операция прервана");
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Функция НачатьСозданиеАктовНаСервере()  
	
	Период = Объект.Период;                                 
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СозданиеРеализаций", Период);
	Возврат ДлительнаяОперация;
		
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТЧ(Массив) Экспорт 
	
	Если ЗначениеЗаполнено(Массив) Тогда
		
	Объект.Договоры.Очистить();
		
	Для Сч = 1 ПО Массив[0].Количество() Цикл
		НоваяСтрока = Объект.Договоры.Добавить(); 
		НоваяСтрока.Договор = Массив[0][СЧ-1];
        НоваяСтрока.Реализации = Массив[1][СЧ-1];
	КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти
